import Vue from 'vue';
import Vuex from 'vuex';

Vue.use(Vuex)

export default new Vuex.Store({
    state:{
        //推荐的标签头
        addTit:["党媒推荐","钓鱼","精品课","音频","时尚","历史","搞笑","数码","养生",
        "手机","宠物","情感","教育","三农","孕产","文化","游戏","股票","健身","彩票",
        "三农","孕产","动漫","情感"
    ],
        //当前的标签头
        curTitArr:["西安","财经","小说","视频","直播","热点","娱乐","菜谱","科技","懂车帝","体育","军事","国际","健康","美食","电影","旅游","房产","育儿","家居","问答","图片","中餐","烹饪技巧","新时代","国风","NBA","值点"],
        
        //当前标签头所对应的组件名；
        comTitName:["","newscon","","","nover",""]
    }
        
})